[
{
	"name": "Isabelle L.",
    "text": "I have been studying piano with Hannah Elster for about three years. I love music, but have never had quite the artistic fiber. I was therefore lucky to find a very patient teacher.  Piano is my favorite instrument, and also one, if not the most, difficult to learn. As an adult student, I do not always have enough time to practice in between lessons. I am fortunate that my teacher respects my pace, is flexible and as a result, we progress well."
},
{
	"name": "Cathy Coale",
	"text": "It is with great pleasure that I highly recommend Hannah Elster as an excellent piano teacher. I have had the pleasure of knowing Hannah for seven years. She taught my children piano for two years before she and her family moved to Austin. Hannah is an immensely talented pianist and musician who also possess a natural gift of teaching. She maintains a high standard of excellence while balancing her teacher/student relationship in a very caring and concerned way. Hannah has an extensive piano repertoire and many practical suggestions for tackling challenging situations a student may experience while learning to play the piano. She not only teaches the student how to read music and play the piano, but also how write and compose his or her own music. My son and daughter, now in high school, still have a wonderful love for music and continue to play the piano."
},
{
	"name": "Elizabeth Furgeson",
	"text": "As a piano instructor myself, I see firsthand the success of Hannah's methods. Having the flexibility to offer varied approaches, based on the students' strengths leads to great success and continued interest. Additionally, when we teach students to use their ears, their eyes and their natural inclinations to create lovely music, the outcome is more often pleasant...and accurate! I have seen students excel with a chord-based approach. I have seen students excel with ear training and music memory but above all, the students taught in Hannah's Studio have achieved success in learning to read music, playing with proper technique and producing music that is pleasing to play and pleasing to hear. In short, Hannah's Studio is well established in creating musicians. Leading students to enjoy music through learning it well is a joy, and it's something that Hannah does well!"
},
{
	"name": "Jenny Wieser",
	"text": "I highly recommend Hannah Elster as a piano teacher. Hannah worked with our son his first 2 years of piano and had she not moved from our town would still be working with him. She is a rigorous teacher which satisfied me, but she also managed to teach a lesson that was fun for our son. I was pleased that she taught theory from the get go. Our son advanced steadily under her teaching."
},
{
	"name": "Kristin Ashman",
	"text": "Hannah taught beginner lessons to my school age daughter for several years, when Hannah was teaching in our area. Over that time, my daughter's piano skills developed beautifully. Hannah was encouraging and kind to her and supported me when I needed her to help me get my daughter to commit to her practice times. This strong foundation really helped my daughter to grow confident in her skills ­ and helped instill a lifelong love of piano and music. Now, as a pianist with around 6­&ndash;7 years of experience, she continues playing, takes advanced lessons and even plays for daily school assembly and school concerts. (And I never have to ask her to practice!)"
},
{
	"name": "Amy Martin",
	"text": "Mrs. Elster taught both of my children for several years. Her encouraging teaching style gave my young beginners courage at the piano, while her high expectations built their confidence. I was glad to see them learn not just the mechanics of the keyboard, but also the language of music theory. I would highly recommend Mrs. Elster to any family looking to begin or continue music instruction."
}
]